def name(user,city):
    print(f"Привіт {user}! ви з міста {city}!")

name(input("Введіть ваше ім'я:"), input("З якого ви міста:?"))
# Функція це блок коду яку можна кучу раз викликати не пишучи великий код а замість цього просто викликати її.
# Цe свого роду змінна яку ми вказуємо в дужках під час створення функції. Це наче порожня комірка, куди функція очікує отримати дані.
# Це реальне значення текст, число, тощо, яке ми передаємо у функцію, коли її викликаємо.
# Тому що функція є універсальною і вона не привязна ні до чого