user = input("Введіть коротке повідомлення: ")
file = open("message.txt", "w",encoding="utf-8")
file.write(user)
file.close()


file = open("message.txt", "r",encoding="utf-8")
res = file.read()
file.close()
print(res)
print("Повідомлення збережено у файл message.txt».")

# Функція open дає змогу відкрити сам файл і ввести параметри для файла.
# режим w ознчає що параметр для файлу конкретно ми будм тільки записувати туди щось.
# тому що якщо не закривати файли то файли можуть застояти в компютері і робити навантаження що в результаті може презвести до зависання.
# при повторному використанні все те що и записали стеретьсся і замінетьсся на нове те що ми написали.