<<<<<<< HEAD
age = int(input("Напишіть ваш рік: ")) # запитуєм скільки років користувачу
# просить користувача ввести чи студент він/вона
status_student = input("напишіть статус студента Так/Ні: ").capitalize()
# просить користувача ввести чи є віп
Vip_student = input("напишіть чи є віп Так/Ні: ").capitalize()
# просить користувача ввести день тижня
day_week = input("Напишіть день тижня: ").capitalize()
# просить користувача ввести суму чеку
suma_check = int(input("Введіть суму чеку: "))
# запитує чи сьогодні в користувача день народження
is_birthday = input("Чи є в вас день народження Так/Ні: ").capitalize()
знижка = 0  # знижка

# Визначаємо основну знижку (спрацює тільки одна з цих умов)
# Якщо ти VIP АБО (студент з великим чеком у вихідні) — даємо 50%
if (Vip_student == "Так") or (status_student == "Так" and suma_check > 1000) and (day_week == "Суботта" or day_week == "Неділля"):
    знижка = 50
# Якщо перша умова не підійшла, перевіряємо: чи ти студент, дитина або пенсіонер 30%
elif status_student == "Так" or (age < 18) or (age >= 65):
    знижка = 30
# Якщо нічого з вищого не підійшло, але сьогодні вихідний — даємо стандартні 15%
elif (day_week == "Суботта") or (day_week == "Неділя"):
    знижка = 15
# Для дня народження множим на 2
if is_birthday == "Так":
    знижка *= 2

# Встановлюємо "стелю" (ліміт)
# Магазин не може віддати товар задарма, тому обмежуємо знижку до 70%
if знижка >= 70:
    знижка = 70
    
# Розрахунок фінальної суми

# Рахуємо, скільки грошей ми "віднімаємо" від ціни
сума_знижки = suma_check * знижка / 100
# Віднімаємо економну суму від початкового чеку
фінальна_ціна = suma_check - сума_знижки

# Виведення результату
print("--- ЗВІТ ---")
print("Ваша знижка %:")
print(знижка)  # Виведе фінальний відсоток
print("Сума, яку ви економите:")
print(сума_знижки)  # Виведе знижку в гривнях
print("Сума до сплати:")
print(фінальна_ціна)  # Скільки реально треба заплатити
=======
age = int(input("Напишіть ваш рік: ")) # запитуєм скільки років користувачу
# просить користувача ввести чи студент він/вона
status_student = input("напишіть статус студента Так/Ні: ").capitalize()
# просить користувача ввести чи є віп
Vip_student = input("напишіть чи є віп Так/Ні: ").capitalize()
# просить користувача ввести день тижня
day_week = input("Напишіть день тижня: ").capitalize()
# просить користувача ввести суму чеку
suma_check = int(input("Введіть суму чеку: "))
# запитує чи сьогодні в користувача день народження
is_birthday = input("Чи є в вас день народження Так/Ні: ").capitalize()
знижка = 0  # знижка

# Визначаємо основну знижку (спрацює тільки одна з цих умов)
# Якщо ти VIP АБО (студент з великим чеком у вихідні) — даємо 50%
if (Vip_student == "Так") or (status_student == "Так" and suma_check > 1000) and (day_week == "Суботта" or day_week == "Неділля"):
    знижка = 50
# Якщо перша умова не підійшла, перевіряємо: чи ти студент, дитина або пенсіонер 30%
elif status_student == "Так" or (age < 18) or (age >= 65):
    знижка = 30
# Якщо нічого з вищого не підійшло, але сьогодні вихідний — даємо стандартні 15%
elif (day_week == "Суботта") or (day_week == "Неділя"):
    знижка = 15
# Для дня народження множим на 2
if is_birthday == "Так":
    знижка *= 2

# Встановлюємо "стелю" (ліміт)
# Магазин не може віддати товар задарма, тому обмежуємо знижку до 70%
if знижка >= 70:
    знижка = 70
    
# Розрахунок фінальної суми

# Рахуємо, скільки грошей ми "віднімаємо" від ціни
сума_знижки = suma_check * знижка / 100
# Віднімаємо економну суму від початкового чеку
фінальна_ціна = suma_check - сума_знижки

# Виведення результату
print("--- ЗВІТ ---")
print("Ваша знижка %:")
print(знижка)  # Виведе фінальний відсоток
print("Сума, яку ви економите:")
print(сума_знижки)  # Виведе знижку в гривнях
print("Сума до сплати:")
print(фінальна_ціна)  # Скільки реально треба заплатити
>>>>>>> b13a8fbef3ff269eace11adb4b8db262612244a7
