<<<<<<< HEAD
number = int(input("Введіть число: "))  # просить ввести роки
if number >= 10 and number <= 50:  # порівняння якщо більше 10 і менше 50 все ок
    print("Все добре")

else:
    print("Помилка")  # якщо ні то помилка
=======
number = int(input("Введіть число: "))  # просить ввести роки
if number >= 10 and number <= 50:  # порівняння якщо більше 10 і менше 50 все ок
    print("Все добре")

else:
    print("Помилка")  # якщо ні то помилка
>>>>>>> b13a8fbef3ff269eace11adb4b8db262612244a7
