# Запитуємо у користувача довжини трьох сторін трикутника
a = int(input("Введіть число: "))
b = int(input("Введіть число: "))
c = int(input("Введіть число: "))

# Математичне правило сума будь-яких двох сторін має бути більшою за третю сторону.
# Якщо всі три умови (and) виконуються == трикутник справжній.
if (a + b > c) and (a + c > b) and (b + c > a):
    print("такий трикутник існує")

# Якщо хоча б одна з умов не справдилася трикутник неможливий
else:
    print("Такого трикутника не існує")
