<<<<<<< HEAD
# даєм значення числа яке має виводити з циклу і даєм можливість зробити цикл бескінечним
secret_number = 5
user = int(input("ВВедіть число "))  # просим в користувача ввести число

while not user == 5:  # якщо наш user не напише 5 то цикл буде повтоювати спробувати ще раз
    print("Спробуй ще раз!")  # якщо ми не напишем число 5
    user = int(input("ВВедіть число ще раз"))
    # дамєм можливість коритувачу ще раз написати число

    if user == 5:  # якщо користувач вів 5
        break  # виходим з цикла програма не працює більше
print("Все добре")  # виводим що все добре бо ми вийшли з програми
=======
# даєм значення числа яке має виводити з циклу і даєм можливість зробити цикл бескінечним
secret_number = 5
user = int(input("ВВедіть число "))  # просим в користувача ввести число

while not user == 5:  # якщо наш user не напише 5 то цикл буде повтоювати спробувати ще раз
    print("Спробуй ще раз!")  # якщо ми не напишем число 5
    user = int(input("ВВедіть число ще раз"))
    # дамєм можливість коритувачу ще раз написати число

    if user == 5:  # якщо користувач вів 5
        break  # виходим з цикла програма не працює більше
print("Все добре")  # виводим що все добре бо ми вийшли з програми
>>>>>>> b13a8fbef3ff269eace11adb4b8db262612244a7
