<<<<<<< HEAD
li =[0,1,2,3,4,5,6,7,8,9]
print(f"виодим перші 4 числа: {li[:5]}")
print(f"виодим останні 3 числа: {li[-3:]}")
print(f"виодим покроково по 2 числа: {li[::2]}")
print(f"виодим останні 2 числа: {li[::-1]}")
=======
li =[0,1,2,3,4,5,6,7,8,9]
print(f"виодим перші 4 числа: {li[:5]}")
print(f"виодим останні 3 числа: {li[-3:]}")
print(f"виодим покроково по 2 числа: {li[::2]}")
print(f"виодим останні 2 числа: {li[::-1]}")
>>>>>>> b13a8fbef3ff269eace11adb4b8db262612244a7
#оскільки ми починаєм з початку до кінця ми воводим їх дальше -1 це крок який ми обертаєм тобто від самого кінця до самого початку номерації