def point():
    print("="*50)
    print()


numbers = [1, 1, 2, 3, 3, 4, 5, 5, 5, 6]
# Перетворити цей список на множину за допомогою функції
print(f"Перетворення на множину:{set(numbers)}")
# Перетворити отриману множину назад у список
point()
print(f"Перетворення на список:{list(set(numbers))}")
point()
# Вивести фінальний список на екран(порівняння)
print(f"Перетворення на множину(поівняння):{set(numbers)}")
point()
print(f"Фінальний результат(list):{list(set(numbers))}")
# Порядок елементів не змінився, оскільки множини (set) є невпорядкованими.
# Хоча для малих чисел він часто збігається, при перетворенні в set оригінальна послідовність втрачається.
