<<<<<<< HEAD
li = ["Банан","Манго","Апельсин","Яблуко","Ківі"]
print(li[0])
print(li[2])
print(li[-1])
#оскільки По системі індексів самий початок це 0 тобто Банан = 0 Манго = 1 де він вважається вже 2
print("\n")
li1 = []
li1 = list(range(1,16))
print(li1)
# Функція range() повертає спеціальний генератор, а не готовий список.
=======
li = ["Банан","Манго","Апельсин","Яблуко","Ківі"]
print(li[0])
print(li[2])
print(li[-1])
#оскільки По системі індексів самий початок це 0 тобто Банан = 0 Манго = 1 де він вважається вже 2
print("\n")
li1 = []
li1 = list(range(1,16))
print(li1)
# Функція range() повертає спеціальний генератор, а не готовий список.
>>>>>>> b13a8fbef3ff269eace11adb4b8db262612244a7
# він видає наступне число лише тоді, коли воно безпосередньо потрібне наприклад коли ми до нього звертаємося.