# Запитуємо дані у користувача
Vip_status = input("Введіть VIP статус (Так/Ні): ").capitalize()

# Перетворюємо вік на число, щоб комп'ютер міг його порівнювати (більше 18 чи ні)
age = int(input("Введіть ваш вік: "))

# Запитуємо про наявність документів
document = input("Чи є у вас документи (Так/Ні): ").capitalize()

# Ми дозволяємо прохід, якщо:
# (Людині є 18 років ТА вона має документи)
# АБО якщо вона є VIP-клієнтом (для них інші правила не важливі)
if (age >= 18 and document == "Так") or Vip_status == "Так":
    print("Прохід доступний")

# 3. Якщо головна умова "if" не спрацювала, переходимо до "else" (причини відмови)
else:
    # Спочатку перевіряємо, чи причина відмови це вік
    if age < 18:
        print("Немає достатньо років")

    # Якщо вік нормальний, але не пускають значить, проблема в документах
    # != означає "не дорівнює", тобто "якщо документ це НЕ 'Так'"
    elif document != "Так":
        print("Немає паспорту")

    # Якщо і вік ок, і документи є, але все одно відмова додамо універсальний варіант для Віп статусу
    else:
        print("Доступ заборонено з інших причин")
