<<<<<<< HEAD
number = 7
множники = 0

while множники < 10:  # поки наші множнки будуть менше 10 то цикл буде продовжувати працювати
    множники += 1  # додаєм під час повторення циклу по +1
    res = number * множники  # множим наше число 7 на числа від 1 до 10 єке буде мінятися
    num = множники
    # виводим що разу після кожного доданого числа
    print(f"{num}. {number} x {множники} = {res}")

#Практична 8
print("\n")
for g in range(1,11):
    for i in range(1,11):
        result = g * i
        print(f"{result:4}",end="" "\t")
    print("\n")
=======
number = 7
множники = 0

while множники < 10:  # поки наші множнки будуть менше 10 то цикл буде продовжувати працювати
    множники += 1  # додаєм під час повторення циклу по +1
    res = number * множники  # множим наше число 7 на числа від 1 до 10 єке буде мінятися
    num = множники
    # виводим що разу після кожного доданого числа
    print(f"{num}. {number} x {множники} = {res}")

#Практична 8
print("\n")
for g in range(1,11):
    for i in range(1,11):
        result = g * i
        print(f"{result:4}",end="" "\t")
    print("\n")
>>>>>>> b13a8fbef3ff269eace11adb4b8db262612244a7
