<<<<<<< HEAD
#метод A
for i in range(2,21,2):
    print(i)
print("\n")

#метод B
for i in range(1,21):
    if i % 2 == 0:
        print(i)

=======
#метод A
for i in range(2,21,2):
    print(i)
print("\n")

#метод B
for i in range(1,21):
    if i % 2 == 0:
        print(i)

>>>>>>> b13a8fbef3ff269eace11adb4b8db262612244a7
# Метод A є більш ефективним з точки зору кількості кроків у циклі: він виконує менше задач по одній на кожне парне число тоді як метод B виконує більше задач спочатку вводить потім шукає і вже тоді видає результат.