<<<<<<< HEAD
for i in range(1, 11):
    print(i)
# Кінцеве значення у range має бути на одиницю більшим (11 замість 10), тому що range включає числа від початку і до конця але за ситемою індексів має віднімати 1

print("\n")

# Завдання 2: Зворотній відлік від 10 до 1 за допомогою range(10, 0, -1)
# Третій аргумент (-1) вказує крок ітерації він зменшує значення на 1 при кожному кроці.
for a in range(10, 0, -1):
=======
for i in range(1, 11):
    print(i)
# Кінцеве значення у range має бути на одиницю більшим (11 замість 10), тому що range включає числа від початку і до конця але за ситемою індексів має віднімати 1

print("\n")

# Завдання 2: Зворотній відлік від 10 до 1 за допомогою range(10, 0, -1)
# Третій аргумент (-1) вказує крок ітерації він зменшує значення на 1 при кожному кроці.
for a in range(10, 0, -1):
>>>>>>> b13a8fbef3ff269eace11adb4b8db262612244a7
    print(a)