<<<<<<< HEAD
full_name = ("Іван Петренко")
# виводить нуль по ситсемі інлексів це значить що перше буква І = 0 а не 1
print(f"{full_name[0]},{full_name[-1]},{full_name[2]}")


name = input("Введіть Піб: ")#Користувач пише Ім'я та Прізвище
space = name.find(" ") # находим пробіл який ми вводим
for_name = name[:space] # поченаєм з самого початку до нашого пролбілу
Прізвище = name[space:]# починаєм вже з пробілу до самого кінця 
print(f"Ім'я:{for_name},Прізвище:{Прізвище}") # виводим спершу #Ім'я потім Прізвище
=======
full_name = ("Іван Петренко")
# виводить нуль по ситсемі інлексів це значить що перше буква І = 0 а не 1
print(f"{full_name[0]},{full_name[-1]},{full_name[2]}")


name = input("Введіть Піб: ")#Користувач пише Ім'я та Прізвище
space = name.find(" ") # находим пробіл який ми вводим
for_name = name[:space] # поченаєм з самого початку до нашого пролбілу
Прізвище = name[space:]# починаєм вже з пробілу до самого кінця 
print(f"Ім'я:{for_name},Прізвище:{Прізвище}") # виводим спершу #Ім'я потім Прізвище
>>>>>>> b13a8fbef3ff269eace11adb4b8db262612244a7
