# Просимо користувача ввести оцінку
user = int(input("Введіть вашу оцінку: "))

if user >= 90:  # Якщо оцінка 90 або більше (аж до 100)
    print("Відмінно 90 - 100", end="!")

# Якщо перша умова не підійшла, перевіряємо, чи оцінка 70 або більше
elif user >= 70:
    print("Добре 70 - 89", end="!")

# Якщо і це не підійшло, перевіряємо, чи оцінка хоча б 40
elif user >= 40:
    print("Середньо 40 - 69 ", end="!")

# Перевірка на низькі оцінки 30 20
elif user >= 20:
    print("Погано 20- 39 ", end="!")

# Якщо оцінка менша за всі попередні варіанти
else:
    print("Найгірші оцінки!")
