a = 144  # зберігання 144
c = a ** 0.5  # квадратний корінь який йде для піднесення степня.  0.5квадратного до 1/3 кубічного
print(c)  # виходить 12.0 12 * 12 вийде 144 але до 12 закругляюєм

num = 27  # зберігання 27
result = num ** (1/3)  # використання кубічного корення
print(result)  # виходить 3.0 адже ми 3 * 3 * 3 = 27

towar1 = 100  # товар1
towar2 = 250  # товар2
towar3 = 120  # товар3
знижка = 25  # знижка 25%
total = towar1 + towar2 + towar3  # розраховуєм загальну суму без знижки 470
sum_together = total * знижка / 100  # рахуєм загальний відсоток від суми  117,5
# та Множимо загальну суму на відсоток і ділимо на 100


final_price = total - sum_together  # Розраховуємо фінальну вартість до сплати
print(sum_together)  # виводим суму економії = 117.5
print(final_price)  # Виведення фінального чека до сплачення = 352.5
